{
    "section": "Technologies",
    "color": "pink",
    "projDesc": "A NUXT microsite S.P.A. serving the 22Squared agency as a \"new business leave behind\" to give to potential clients as a digital business card after initial consultation. The site features various interactive elements, subtle animations, responsive layouts, and modals with a user-controllable carousel. In addition to this, the project has been coded with headless C.M.S. integration in mind (Builder.io)",
    "btnOne": "Visit Website",
    "linkOne": "https://whatsnew.22squared.com/",
    "repoAvail": 0,
    "btnTwo": "Private Repository",
    "btnTwoDesc": "contact for code info",
    "mainImg": "NBLB.png",
    "img2": "NBLB-Pic2.png",
    "img3": "NBLB-Pic3.png",
    "techs": [
        {
            "techName": "Vue",
            "icon": "vue.svg",
            "desc": "an open-source model–view–viewmodel front end JavaScript framework for building user interfaces and single-page applications."
        },
        {
            "techName": "NUXT",
            "icon": "nuxt.svg",
            "desc": "a frontend framework built upon Vue. js that offers great development features such as server side rendering, automatically generated routes, improved meta tags managing and SEO improvement."
        },
        {
            "techName": "Tailwind",
            "icon": "tailwind.svg",
            "abbr": "Tailwind CSS",
            "desc": "a highly customizable utility-first CSS framework for rapidly building custom user interfaces."
        },
        {
            "techName": "Illustrator",
            "icon": "illustrator.svg",
            "abbr": "Adobe illustrator",
            "desc": "a software application for creating drawings, illustrations, and artwork using vector graphics technology."
        },
        {
            "techName": "Javascript",
            "icon": "javascript.svg",
            "desc": "a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS."
        },
        {
            "techName": "CSS",
            "icon": "css.svg",
            "abbr": "Cascading Style Sheets",
            "desc": "a style sheet language used for describing the presentation of a document written in a markup language such as HTML."
        },
        {
            "techName": "Figma",
            "icon": "figma.svg",
            "desc": "a collaborative browser-based interface design and prototyping tool."
        },
        {
            "techName": "Builder",
            "icon": "builder.svg",
            "abbr": "Builder.io",
            "desc": "a visual software development platform. Builder serves as a CMS allowing customization and configurization by web developers, while giving drag-and-drop controls to non-developers in the team. Configuration by the developer ensures work performed by other team members fits within the brand and feel of the company."
        }
    ]
}